{"class_name": "Model", "keras_version": "1.1.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 59049, 1], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_1", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_uniform", "bias": true, "nb_filter": 128, "input_dim": null, "subsample_length": 3, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution1d_1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution1d_1", 0, 0]]], "name": "batchnormalization_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "activation_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_2", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_uniform", "bias": true, "nb_filter": 128, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["activation_1", 0, 0]]], "name": "convolution1d_2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_2", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution1d_2", 0, 0]]], "name": "batchnormalization_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "activation_2"}, {"class_name": "MaxPooling1D", "config": {"stride": 3, "pool_length": 3, "trainable": true, "name": "maxpooling1d_1", "border_mode": "valid"}, "inbound_nodes": [[["activation_2", 0, 0]]], "name": "maxpooling1d_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_3", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_uniform", "bias": true, "nb_filter": 128, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["maxpooling1d_1", 0, 0]]], "name": "convolution1d_3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution1d_3", 0, 0]]], "name": "batchnormalization_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "activation_3"}, {"class_name": "MaxPooling1D", "config": {"stride": 3, "pool_length": 3, "trainable": true, "name": "maxpooling1d_2", "border_mode": "valid"}, "inbound_nodes": [[["activation_3", 0, 0]]], "name": "maxpooling1d_2"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_4", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_uniform", "bias": true, "nb_filter": 256, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["maxpooling1d_2", 0, 0]]], "name": "convolution1d_4"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_4", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution1d_4", 0, 0]]], "name": "batchnormalization_4"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "name": "activation_4"}, {"class_name": "MaxPooling1D", "config": {"stride": 3, "pool_length": 3, "trainable": true, "name": "maxpooling1d_3", "border_mode": "valid"}, "inbound_nodes": [[["activation_4", 0, 0]]], "name": "maxpooling1d_3"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_5", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_uniform", "bias": true, "nb_filter": 256, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["maxpooling1d_3", 0, 0]]], "name": "convolution1d_5"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_5", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution1d_5", 0, 0]]], "name": "batchnormalization_5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "name": "activation_5"}, {"class_name": "MaxPooling1D", "config": {"stride": 3, "pool_length": 3, "trainable": true, "name": "maxpooling1d_4", "border_mode": "valid"}, "inbound_nodes": [[["activation_5", 0, 0]]], "name": "maxpooling1d_4"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_6", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_uniform", "bias": true, "nb_filter": 256, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["maxpooling1d_4", 0, 0]]], "name": "convolution1d_6"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_6", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution1d_6", 0, 0]]], "name": "batchnormalization_6"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["batchnormalization_6", 0, 0]]], "name": "activation_6"}, {"class_name": "MaxPooling1D", "config": {"stride": 3, "pool_length": 3, "trainable": true, "name": "maxpooling1d_5", "border_mode": "valid"}, "inbound_nodes": [[["activation_6", 0, 0]]], "name": "maxpooling1d_5"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_7", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_uniform", "bias": true, "nb_filter": 256, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["maxpooling1d_5", 0, 0]]], "name": "convolution1d_7"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_7", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution1d_7", 0, 0]]], "name": "batchnormalization_7"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "inbound_nodes": [[["batchnormalization_7", 0, 0]]], "name": "activation_7"}, {"class_name": "MaxPooling1D", "config": {"stride": 3, "pool_length": 3, "trainable": true, "name": "maxpooling1d_6", "border_mode": "valid"}, "inbound_nodes": [[["activation_7", 0, 0]]], "name": "maxpooling1d_6"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_8", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_uniform", "bias": true, "nb_filter": 256, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["maxpooling1d_6", 0, 0]]], "name": "convolution1d_8"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_8", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution1d_8", 0, 0]]], "name": "batchnormalization_8"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "inbound_nodes": [[["batchnormalization_8", 0, 0]]], "name": "activation_8"}, {"class_name": "MaxPooling1D", "config": {"stride": 3, "pool_length": 3, "trainable": true, "name": "maxpooling1d_7", "border_mode": "valid"}, "inbound_nodes": [[["activation_8", 0, 0]]], "name": "maxpooling1d_7"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_9", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_uniform", "bias": true, "nb_filter": 256, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["maxpooling1d_7", 0, 0]]], "name": "convolution1d_9"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_9", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution1d_9", 0, 0]]], "name": "batchnormalization_9"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "inbound_nodes": [[["batchnormalization_9", 0, 0]]], "name": "activation_9"}, {"class_name": "MaxPooling1D", "config": {"stride": 3, "pool_length": 3, "trainable": true, "name": "maxpooling1d_8", "border_mode": "valid"}, "inbound_nodes": [[["activation_9", 0, 0]]], "name": "maxpooling1d_8"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_10", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_uniform", "bias": true, "nb_filter": 256, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["maxpooling1d_8", 0, 0]]], "name": "convolution1d_10"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_10", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution1d_10", 0, 0]]], "name": "batchnormalization_10"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "inbound_nodes": [[["batchnormalization_10", 0, 0]]], "name": "activation_10"}, {"class_name": "MaxPooling1D", "config": {"stride": 3, "pool_length": 3, "trainable": true, "name": "maxpooling1d_9", "border_mode": "valid"}, "inbound_nodes": [[["activation_10", 0, 0]]], "name": "maxpooling1d_9"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_11", "activity_regularizer": null, "trainable": true, "filter_length": 1, "init": "he_uniform", "bias": true, "nb_filter": 256, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["maxpooling1d_9", 0, 0]]], "name": "convolution1d_11"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_11", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution1d_11", 0, 0]]], "name": "batchnormalization_11"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "inbound_nodes": [[["batchnormalization_11", 0, 0]]], "name": "activation_11"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["activation_11", 0, 0]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 50}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]], "name": "model_1"}}